finassaf/lywsd03mmc_remote_display/nrf52_bridge/ble_app/main.c
        case BLE_GAP_EVT_ADV_REPORT:
        {
            if ((p_ble_evt->evt.gap_evt.params.adv_report.peer_addr.addr[0] == 0xE1) &&
                (p_ble_evt->evt.gap_evt.params.adv_report.peer_addr.addr[1] == 0x78) &&
                (p_ble_evt->evt.gap_evt.params.adv_report.peer_addr.addr[2] == 0xAE) &&
                (p_ble_evt->evt.gap_evt.params.adv_report.peer_addr.addr[3] == 0x38) &&
                (p_ble_evt->evt.gap_evt.params.adv_report.peer_addr.addr[4] == 0xC1) &&
                (p_ble_evt->evt.gap_evt.params.adv_report.peer_addr.addr[5] == 0xA4))
            {
                if (state == 1)
                {
                    temperature = p_ble_evt->evt.gap_evt.params.adv_report.data.p_data[11] + 
                                    ((uint16_t)p_ble_evt->evt.gap_evt.params.adv_report.data.p_data[10] << 8);
                    uint8_t humidity = p_ble_evt->evt.gap_evt.params.adv_report.data.p_data[12];
                    NRF_LOG_INFO("Temperature: %d.%d", (temperature / 10), (temperature % 10));
                    NRF_LOG_INFO("Humidity: %d %%", humidity);
                    // for (uint8_t i = 0; i < p_ble_evt->evt.gap_evt.params.adv_report.data.len; i++)
                    // {
                    //     NRF_LOG_INFO("data[%d] = %d", i, p_ble_evt->evt.gap_evt.params.adv_report.data.p_data[i]);
                    // }
                    
                    nrf_ble_scan_stop();
                }
                
            }
            break;
        }

        default:
            break;
    }
}


/**@brief SoftDevice SoC event handler.
 *
 * @param[in]   evt_id      SoC event.
 * @param[in]   p_context   Context.
 */
static void soc_evt_handler(uint32_t evt_id, void * p_context)
{
    switch (evt_id)
    {
        case NRF_EVT_FLASH_OPERATION_SUCCESS:
            /* fall through */
        case NRF_EVT_FLASH_OPERATION_ERROR:

            if (m_memory_access_in_progress)
            {
                m_memory_access_in_progress = false;
                //scan_start();
            }
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register handlers for BLE and SoC events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
    NRF_SDH_SOC_OBSERVER(m_soc_observer, APP_SOC_OBSERVER_PRIO, soc_evt_handler, NULL);
}



/**@brief Function for the Peer Manager initialization.
 */
static void peer_manager_init(void)
{
    ble_gap_sec_params_t sec_param;
    ret_code_t err_code;

    err_code = pm_init();
    APP_ERROR_CHECK(err_code);

    memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

    // Security parameters to be used for all security procedures.
    sec_param.bond           = SEC_PARAM_BOND;
    sec_param.mitm           = SEC_PARAM_MITM;
    sec_param.lesc           = SEC_PARAM_LESC;
    sec_param.keypress       = SEC_PARAM_KEYPRESS;
    sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
    sec_param.oob            = SEC_PARAM_OOB;
    sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
    sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;

    err_code = pm_sec_params_set(&sec_param);
    APP_ERROR_CHECK(err_code);

    err_code = pm_register(pm_evt_handler);
    APP_ERROR_CHECK(err_code);
}


/** @brief Clear bonding information from persistent storage
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for disabling the use of whitelist for scanning.
 */
static void whitelist_disable(void)
{
    if (!m_whitelist_disabled)
    {
        NRF_LOG_INFO("Whitelist temporarily disabled.");
        m_whitelist_disabled = true;
        // nrf_ble_scan_stop();
        // scan_start();
    }
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    ret_code_t err_code;

    switch (event)
    {
        case BSP_EVENT_SLEEP:
            nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            whitelist_disable();
            break;

        default:
            break;
    }
}

/**@brief Heart Rate Collector Handler.
 */
static void env_c_evt_handler(ble_env_c_t * p_env_c, ble_env_c_evt_t * p_env_c_evt)
{
    ret_code_t err_code;

    switch (p_env_c_evt->evt_type)
    {
        case BLE_ENV_C_EVT_DISCOVERY_COMPLETE:
        {
            NRF_LOG_INFO("Env service discovered. Temperature %d", temperature);

            err_code = ble_env_c_handles_assign(p_env_c, p_env_c_evt->conn_handle, &p_env_c_evt->handles);
            m_conn_handle = p_env_c_evt->conn_handle;
            APP_ERROR_CHECK(err_code);

            uint8_t cmd[2] = {0xFA, (uint8_t)((temperature / 10))};
            ble_env_c_string_send(&m_env_c, cmd, 2);
            cmd[0] = 0xFB;
            cmd[1] = (temperature % 10);
            ble_env_c_string_send(&m_env_c, cmd, 2);
            // gTempWritten = true;
        } break;

        default:
            break;
    }
}


