finassaf/lywsd03mmc_remote_display/nrf52_bridge/ble_app/main.c
/**@brief Function for initialization scanning and setting filters.
 */
static void scan_init(bool is_display)
{
    ret_code_t          err_code;
    nrf_ble_scan_init_t init_scan;

    memset(&init_scan, 0, sizeof(init_scan));

    init_scan.p_scan_param     = &m_scan_param;
    init_scan.connect_if_match = is_display; // only need to connect to display
    init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

    err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
    APP_ERROR_CHECK(err_code);

    if (strlen(m_target_periph_name) != 0)
    {
        err_code = nrf_ble_scan_filter_set(&m_scan,
                                           SCAN_NAME_FILTER,
                                           m_target_periph_name);
        APP_ERROR_CHECK(err_code);
    }

    if (is_connect_per_addr)
    {
       uint8_t* pAddress;
       if (is_display == true)
       {
           pAddress = m_display_periph_addr.addr;
       }
       else
       {
           pAddress = m_sensor_periph_addr.addr;
       }
       err_code = nrf_ble_scan_filter_set(&m_scan,
                                          SCAN_ADDR_FILTER,
                                          pAddress);
       APP_ERROR_CHECK(err_code);
    }

    err_code = nrf_ble_scan_filters_enable(&m_scan,
                                           NRF_BLE_SCAN_ALL_FILTER,
                                           false);
    APP_ERROR_CHECK(err_code);

}


/**@brief Function for handling the idle state (main loop).
 *
 * @details Handle any pending log operation(s), then sleep until the next event occurs.
 */
static void idle_state_handle(void)
{
    ret_code_t err_code;
    
    err_code = nrf_ble_lesc_request_handler();
    APP_ERROR_CHECK(err_code);
    
    NRF_LOG_FLUSH();
    nrf_pwr_mgmt_run();
}


void scanning_timer_handle(void * p_context)
{
    if (state == 0)
    {
        // Read temperature value from the sensor
        NRF_LOG_INFO("(%d) - Scanning for temperature sensor.", state);
        nrf_ble_scan_all_filter_remove(&m_scan);
        scan_init(false);
        scan_start();
        app_timer_start(m_scanning_timer, APP_TIMER_TICKS(10000), NULL);
        
    }
    else if (state == 1)
    {
        // Stop scanning
        NRF_LOG_INFO("(%d) - Scan stopped.", state);
        nrf_ble_scan_stop();
        app_timer_start(m_scanning_timer, APP_TIMER_TICKS(5000), NULL);
    }
    else if (state == 2)
    {
        // Connect to display and try to write the latest temperature value
        NRF_LOG_INFO("(%d) - Trying to connect the dispaly.", state);
        nrf_ble_scan_all_filter_remove(&m_scan);
        scan_init(true);
        scan_start();
        app_timer_start(m_scanning_timer, APP_TIMER_TICKS(20000), NULL);
        
    }
    else if (state == 3)
    {
        NRF_LOG_INFO("(%d) - Display writing interval done.", state);
        //nrf_ble_scan_stop();
        app_timer_start(m_scanning_timer, APP_TIMER_TICKS(5*60000), NULL);
        //if (gTempWritten == true)
        //{
            sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            //gTempWritten = false;
        //}
    }

    state++;
    if (state == 4)
    {
        state = 0;
    }
}

int main(void)
{
    // bool erase_bonds;

    // Initialize.
    log_init();
    timer_init();
    power_management_init();
    // buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gatt_init();
    peer_manager_init();
    db_discovery_init();
    //hrs_c_init();
    //bas_c_init();
    env_sense_c_init();

    app_timer_create(&m_scanning_timer, APP_TIMER_MODE_SINGLE_SHOT, scanning_timer_handle);
    app_timer_start(m_scanning_timer, APP_TIMER_TICKS(100), NULL);

    // Start execution.
    NRF_LOG_INFO("App started.");

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


